// WhoBrokeTheVase.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
/*请判断花瓶是谁打碎的。教师花瓶碎了，班级只有四个小同学，老师询问小同学，已知是其中1人打碎的，
还知道4人中每个人要么是诚实的，要么总是说谎的。
小同学回答老师的问题是：
甲说：“乙没有打碎，是丁打碎的。”
乙说：“我没有打碎，是丙打碎的。”
丙说：“甲没有打碎，是乙打碎的。”
丁说：“我没有打碎。”
根据四人回答判断谁打碎了花瓶。*/





// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
